// Напишите программу, которая на вход принимает число
// и выдает его квадрат 

Console.WriteLine("Введите число: ");
int number = int.Parse(Console.ReadLine());

Console.WriteLine($"Квадрат числа {number} равен = {number*number}");